%--------------------------------------------------------------------------
% 利用Chebyshev最佳一致逼近方法，设计一个低通FIR滤波器，
% 要求通带边界频率wp  = 0.6π，阻带边界ws = 0.7π，
% 通带内允许的最大衰减ap=0.4916 dB, 阻带内允许的最小衰减as=44.7dB
%--------------------------------------------------------------------------
clear all;

% 先求滤波器的阶次；
f=[.6 .7];
A=[1 0];
rp=0.4916;
rs=44.7;
dev=[1-10^(-rp/20) 10^(-rs/20)];
%
[n,f0,A0,w]=remezord(f,A,dev)
%
if rem(n,2)
   n=n+1;
end

% 再用切比雪夫最佳一致逼近设计线性相位FIR滤波器；
b=remez(n,f0,A0,w);

[h,w]=freqz(b,1,256,1);
h=abs(h);
h=20*log10(h);
figure(1)
stem(b,'.');grid;
figure(2)
plot(w,h);grid;
  