%--------------------------------------------------------------------------
% 利用Chebyshev最佳一致逼近方法设计一个多阻带陷波器，
% 以去除工频信号(50Hz)及二次、三次谐波(100Hz及150Hz)的干扰，
% 已知采样频率为500Hz
%-------------------------------------------------------------------------
clear all;

% 用切比雪夫最佳一致逼近设计线性相位多带FIR滤波器；
f=[0 .14 .18 .22 .26 .34 .38 .42 .46 .54 .58 .62 .66 1];
A=[1 1  0 0 1 1 0 0 1 1 0 0 1 1];
weigh=[8 1 8 1 8 1 8];	
b=remez(64,f,A,weigh);
%
[h,w]=freqz(b,1,256,1);
hr=abs(h);
h=abs(h);
h=20*log10(h);
figure(1)
stem(b,'.');grid;
figure(2)
plot(w,h);grid;

