%----------------------------------------------------------------------------
% 利用Chebyshev最佳一致逼近方法设计一个多阻带陷波器，
% 以去除工频信号(50Hz)及二次、三次谐波(100Hz及150Hz)的干扰，已知采样频率为500Hz, 
% 要求通带内允许的最大衰减ap=0.153 dB, 阻带内允许的最小衰减as=16.92dB
%----------------------------------------------------------------------------
clear all;

% 先求滤波器的阶次；
f=[.14 .18 .22 .26 .34 .38 .42 .46 .54 .58 .62 .66];
A=[1 0 1 0 1 0 1];
rp=0.153;
rs=16.92;
devp=1-10^(-rp/20);
devs=10^(-rs/20);
dev=[devp devs devp devs devp devs devp];
[n,f0,A0,w]=remezord(f,A,dev)

if rem(n,2)
   n=n+1;
end
%再用切比雪夫最佳一致逼近设计多带线性相位FIR滤波器；
b=remez(n,f0,A0,w);

[h,w]=freqz(b,1,256,1);
hr=abs(h);
h=abs(h);
h=20*log10(h);
figure(1)
stem(b,'.');grid;
figure(2)
plot(w,h);grid;

