/********************************************************************
 *                                                                  *
 *                                                                  *
 *  汽车奔驰                                               *
 *                                                                  *
 *                                                                  *
 ********************************************************************/
#include <stdio.h>

#include <graphics.h>
#include <math.h>
#include <malloc.h>
#include <dos.h>

void main()
{
   int gd=VGA, gm=VGAHI;      /* 图形函数用的变量 */

   /* ------------  动画用的变量 ------------*/
   int i;
   void *w;              /* 保存图形用的变量   */


   /* ------------ 初始化图形设备 ------------*/
   initgraph(&gd, &gm, "C:\\TC20\\BGI");
   cleardevice();  /*清除屏幕*/
   /* ------------ 制作并保存图形 ------------*/
setbkcolor(3);
setcolor(4);
setfillstyle(1,BROWN);
  bar3d(520,245,550,260,8,1);
  bar3d(550,230,600,260,8,1);
  circle(535,260,8);
  circle(575,260,8);
   /* ------------ 分配内存，并保存图形 -------*/
   w = malloc(imagesize(520,220,630,268));
   getimage(520,220,630,268,w);
   cleardevice();
   /*------------- 进行动画 ------------------*/
   for(i=550;i>0;i--)
   {
      putimage(i-1,216,w,COPY_PUT);
	  delay(20);
      line(2,265,630,265);
    }


getch();
/*------------- 释放内存 ------------------*/
   free(w);

   /*------------- 关闭图形模式 --------------*/
   closegraph();
}
